# Text editors
brew "ctags-exuberant"
brew "macvim"
brew "markdown"

# Terminal Tools
brew "proctools"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "ack"
brew "fzf"

# Application Dependencies
brew "redis"
brew "chruby"
brew "ruby-install"

# Hashicorp Tools
brew "nomad"
brew "vault"
brew "consul"
brew "terraform"

# Databases
brew "mysql@5.7"
brew "postgresql@9.6"

# Javascript
brew "nvm"
brew "yarn"
